<script lang="ts" setup>
const dataList = ref([
    {
        id: 1,
        userID: 1212,
        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
        created: 17777777,
        attachedFiles: [
            {
                type: 'image',
                width: 300,
                height: 100,
                size: 1,
                src: '/img/course.png'
            }
        ],
        role: 'user',
        src_download_attached: '/'
    },
    {
        id: 2,
        userID: 12,
        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
        created: 17777777,
        attachedFiles: [
            {
                type: 'image',
                width: 300,
                height: 300,
                size: 1,
                src: '/img/profile1.png'
            }
        ],
        role: 'admin',
        src_download_attached: '/'
    }
])

const dataUser = ref([
    {
    id:1212, 
    name: 'علیرضا',
    family: 'زنگنه',
    avatar: '/img/profile1.png',
    },
    {
    id:12, 
    name: 'مهدی',
    family: 'مختاری',
    avatar: '/img/profile1.png',
    }
])
</script>

<template>
    <div class="container-self-ticket  ">
        <div>
            <span class="font-semibold">{{ $t('support.ticket') }} 183# - محتوای توضیحات کودک</span>
        </div>
        <div class="container-self-ticket ">
            <SupportCardSelfTicket :dataList="data" :dataUser="dataUser"  v-for="data in dataList" :key="data.id" />
        </div>
    </div>
</template>

<style scoped>
.container-self-ticket {
    @apply w-full flex flex-col gap-y-5
}
</style>
